TransportManagementDevelop_KAT/Конфигурация/src/DataProcessors/гкс_ПриемкаТранспорта/гкс_ПриемкаТранспорта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>гкс_ПриемкаТранспорта</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРегистрации</name>
    <type>
      <types>EnumRef.гкс_ТипРегистрации</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипРегистрации/гкс_ТипРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипРегистрации</name>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_Фрахт/гкс_Фрахт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_Фрахт</name>
  <registerRecords>InformationRegister.гкс_СостоянияФрахта</registerRecords>
  <registerRecords>InformationRegister.гкс_ПланыРазгрузкиСудов</registerRecords>
  <attributes>
    <name>Судно</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.гкс_СтатусыСудов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.гкс_ВидыОперацийФрахта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрибытияНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрибытияОкончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУбытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Грузы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияВеса</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПланОбработкиСудна</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Трюм</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияВеса</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОчередностьОбработки</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиПОС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Причал</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Склады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.гкс_ТочкиМаршрута</types>
      </type>
    </attributes>
    <attributes>
      <name>Трюм</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПропорцияСмешивания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_РабочаяСмена/гкс_РабочаяСмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_РабочаяСмена</name>
  <registerRecords>InformationRegister.гкс_СостоянияОбработкиСудов</registerRecords>
  <registerRecords>InformationRegister.гкс_СостоянияФрахта</registerRecords>
  <registerRecords>AccumulationRegister.гкс_ВыработкаСмены</registerRecords>
  <registerRecords>AccumulationRegister.гкс_ОбработкаСудов</registerRecords>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныеСутки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фрахт</name>
    <type>
      <types>DocumentRef.гкс_Фрахт</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбработкаСудна</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Силос</name>
      <type>
        <types>CatalogRef.гкс_ТочкиМаршрута</types>
      </type>
    </attributes>
    <attributes>
      <name>Трюм</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Весы</name>
      <type>
        <types>CatalogRef.гкс_ОборудованиеПЛК</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыгруженПолностью</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРегистрации</name>
      <type>
        <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_ПрибытиеСуднаНаПЛК/гкс_ПрибытиеСуднаНаПЛК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_ПрибытиеСуднаНаПЛК</name>
  <basedOn>Document.гкс_Фрахт</basedOn>
  <registerRecords>InformationRegister.гкс_СостоянияФрахта</registerRecords>
  <registerRecords>InformationRegister.гкс_ТранспортныеДокументыФрахта</registerRecords>
  <registerRecords>AccumulationRegister.гкс_ОбработкаСудов</registerRecords>
  <attributes>
    <name>Фрахт</name>
    <type>
      <types>DocumentRef.гкс_Фрахт</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияВеса</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТранспортныеДокументы</name>
    <attributes>
      <name>ТранспортныйДокумент</name>
      <type>
        <types>DocumentRef.гкс_ТранспортныйДокумент</types>
      </type>
    </attributes>
    <attributes>
      <name>Трюм</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВТрюме</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоДокументу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/DataProcessors/гкс_ПриемкаТранспорта/Forms/ФормаМорскиеПеревозки/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АвтоЗаголовок = Ложь;
	Заголовок = НСтр("ru = 'Рабочее место ""Приемка и отгрузка на ПЛК"": Морской транспорт'");
	
	ОтборТипРегистрации = Перечисления.гкс_ТипРегистрации.Приемка;
	гкс_ПриемкаТранспортаСлужебный.ИнициализироватьОтборТочкаМаршрута(ЭтотОбъект);
	
	СхемаКомпоновки = Обработки.гкс_ПриемкаТранспорта.ПолучитьМакет("ДеталиФрахтов");
	ДополнительныеСвойства = СписокФрахтов.КомпоновщикНастроек.Настройки.ДополнительныеСвойства;
	ДополнительныеСвойства.Вставить(
		"АдресСхемыКомпоновкиДанных", ПоместитьВоВременноеХранилище(СхемаКомпоновки, Новый УникальныйИдентификатор));
	ДополнительныеСвойства.Вставить(
		"УникальныйИдентификаторФормы", УникальныйИдентификатор); // Для подключения УведомленияКлиента()
	
	СхемаКомпоновки = Обработки.гкс_ПриемкаТранспорта.ПолучитьМакет("ДеталиКоносаментов");
	ДополнительныеСвойства = СписокКоносаментов.КомпоновщикНастроек.Настройки.ДополнительныеСвойства;
	ДополнительныеСвойства.Вставить(
		"АдресСхемыКомпоновкиДанных", ПоместитьВоВременноеХранилище(СхемаКомпоновки, Новый УникальныйИдентификатор));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтборыДинамическихСписков();
	УстановитьОформлениеПоТипуРегистрации();
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СписокФрахтовПослеПолученияДанных", ЭтотОбъект);
	УведомленияКлиента.ПодключитьОбработчик(
		КлючУведомленияПослеПолученияДанных("СписокФрахтов", УникальныйИдентификатор), ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипРегистрацииПриИзменении(Элемент)
	
	УстановитьОтборыДинамическихСписков(Истина, Ложь);
	УстановитьОформлениеПоТипуРегистрации();

КонецПроцедуры

&НаКлиенте
Процедура ОтборТочкаМаршрутаПриИзменении(Элемент)
	УстановитьОтборыДинамическихСписков();
КонецПроцедуры

&НаКлиенте
Процедура ОтборНоменклатураПриИзменении(Элемент)
	УстановитьОтборыДинамическихСписков();
КонецПроцедуры

&НаКлиенте
Процедура ОтборСудноПриИзменении(Элемент)
	УстановитьОтборыДинамическихСписков();
КонецПроцедуры

&НаКлиенте
Процедура ОтборСостояниеПриИзменении(Элемент)
	УстановитьОтборыДинамическихСписков(Истина, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОтборДатаПрибытияПриИзменении(Элемент)
	УстановитьОтборыДинамическихСписков(Истина, Ложь);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокФрахтов

&НаКлиенте
Процедура СписокФрахтовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле = Элементы.СписокФрахтовПрибытиеСуднаНаПЛК Тогда	
		ПоказатьЗначение(Неопределено, ТекущиеДанные.ПрибытиеСуднаНаПЛК);
	Иначе
		ПоказатьЗначение(Неопределено, ТекущиеДанные.Фрахт);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СписокФрахтовПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.СписокФрахтов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		ФрахтОтбор = ПредопределенноеЗначение("Документ.гкс_Фрахт.ПустаяСсылка");
	Иначе 
		ФрахтОтбор = ТекущиеДанные.Фрахт;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		СостояниеОбработкиСудна, "Фрахт", ФрахтОтбор,,, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		СостояниеОбработкиТрюма, "Фрахт", ФрахтОтбор,,, Истина);
	
	УстановитьДоступностьКомандФормы(ТекущиеДанные);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокФрахтовПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	ДополнительныеДанные = ДополнительныеДанныеДляСписка(Настройки, Строки, "Фрахт");
	Для Каждого СтрокаДеталей Из ДополнительныеДанные Цикл 
		
		СтрокаСписка = Строки[СтрокаДеталей.Фрахт];
		СтрокаСписка.Данные["Номенклатура"] = СтрокаДеталей.Номенклатура;
		СтрокаСписка.Данные["Количество"] 	= СтрокаДеталей.Количество;

	КонецЦикла;
	
	Адресаты = Новый Массив;
	Адресаты.Добавить(НомерСеансаИнформационнойБазы());
	КлючУведомления = КлючУведомленияПослеПолученияДанных(
		"СписокФрахтов", Настройки.ДополнительныеСвойства.УникальныйИдентификаторФормы);
	// Второй параметр обязательный и при передачи в него Неопределено уведомление не отправляется.
	// Поэтому заполняем его любым значением.
	УведомленияКлиента.ОтправитьУведомление(КлючУведомления, 1, Адресаты);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокКоносаментов

&НаСервереБезКонтекста
Процедура СписокКоносаментовПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	ДополнительныеДанные = ДополнительныеДанныеДляСписка(Настройки, Строки, "Коносамент");
	Для Каждого СтрокаДеталей Из ДополнительныеДанные Цикл 
		
		СтрокаСписка = Строки[СтрокаДеталей.Коносамент];
		СтрокаСписка.Данные["ТранспортноеСредство"] = СтрокаДеталей.ТранспортноеСредство;
		СтрокаСписка.Данные["Номенклатура"] 		= СтрокаДеталей.Номенклатура;
		СтрокаСписка.Данные["ВесНетто"] 			= СтрокаДеталей.ВесНетто;
		СтрокаСписка.Данные["Фрахт"] 				= СтрокаДеталей.Фрахт;

	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСостояниеОбработкиСудна

&НаКлиенте
Процедура СостояниеОбработкиСуднаПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.СостояниеОбработкиСудна.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		ТрюмОтбор	= "";
	Иначе 
		ТрюмОтбор	= ТекущиеДанные.Трюм;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		СостояниеОбработкиТрюма, "Трюм", ТрюмОтбор,,, Истина);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСостояниеОбработкиТрюма

&НаКлиенте
Процедура СостояниеОбработкиТрюмаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(Неопределено, ТекущиеДанные.Регистратор);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтборДатаПрибытияУбавить(Команда)
	НачатьРедактированиеДатыОтборы(-1);
КонецПроцедуры

&НаКлиенте
Процедура ОтборДатаПрибытияДобавить(Команда)
	НачатьРедактированиеДатыОтборы(1);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПрибытиеСудна(Команда)
	
	ТекущиеДанные = Элементы.СписокФрахтов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено
		Или ЗначениеЗаполнено(ТекущиеДанные.ПрибытиеСуднаНаПЛК) Тогда
		Возврат;
	КонецЕсли;
	
	НачатьСозданиеПрибытияСуднаНаПЛК(ТекущиеДанные.Фрахт);
		
КонецПроцедуры

&НаКлиенте
Процедура РабочаяСменаНачать(Команда)
	
	ТекущиеДанные = Элементы.СписокФрахтов.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		ДанныеФормыДляРабочейСмены = Новый Структура;
		ДанныеФормыДляРабочейСмены.Вставить("Фрахт", ТекущиеДанные.Фрахт);
		ДанныеФормыДляРабочейСмены.Вставить("ТочкаМаршрута", ОтборТочкаМаршрута);
		НачатьСозданиеРабочейСмены(ДанныеФормыДляРабочейСмены);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеРазгрузкой(Команда)
	
	СменыФрахта = гкс_МорскаяЛогистикаВызовСервера.СменыФрахта(Элементы.СписокФрахтов.ТекущиеДанные.Фрахт);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидОперации", "НачатьРазгрузку");
	ПараметрыФормы.Вставить("РабочаяСмена", СменыФрахта[0]);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыходаИзУправленияРазгрузкой", ЭтотОбъект);
	
	ИмяОткрываемойФормы = "Документ.гкс_РабочаяСмена.Форма.ПомощникЗаполнения";
	ОткрытьФорму(
		ИмяОткрываемойФормы, ПараметрыФормы, ЭтотОбъект,,,, 
		ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ДинамическиеСписки

#Область ПараметрыОтборыДинамическихСписков

&НаКлиенте
Процедура УстановитьОтборыДинамическихСписков(ДляСпискаФрахтов = Истина, ДляСпискаКоносаментов = Истина)
	
	Если ДляСпискаФрахтов Тогда
		УстановитьОтборыСпискаФрахтов();
	КонецЕсли;
	Если ДляСпискаКоносаментов Тогда
		УстановитьОтборыСпискаКоносаментов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборыСпискаФрахтов()
	
	ОтборВидОперации = гкс_МорскаяЛогистикаКлиентСервер.ВидОперацииФрахтаПоТипуРегистрации(ОтборТипРегистрации);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		СписокФрахтов, "ОтборВидОперации", ОтборВидОперации,,, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		СписокФрахтов, "ОтборТочкаМаршрута", ОтборТочкаМаршрута,,, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		СписокФрахтов, "ОтборНоменклатура", ОтборНоменклатура,,, Не ОтборНоменклатура.Пустая());
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		СписокФрахтов, "ОтборСудно", ОтборСудно,,, Не ОтборСудно.Пустая());
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		СписокФрахтов, "ОтборСостояние", ОтборСостояние,,, Не ОтборСостояние.Пустая());
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		СписокФрахтов, "ОтборДатаПрибытия", ОтборДатаПрибытия,,, ЗначениеЗаполнено(ОтборДатаПрибытия));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборыСпискаКоносаментов()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		СписокКоносаментов, "ОтборТочкаМаршрута", ОтборТочкаМаршрута,,, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		СписокКоносаментов, "ОтборНоменклатура", ОтборНоменклатура,,, Не ОтборНоменклатура.Пустая());
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		СписокКоносаментов, "ОтборСудно", ОтборСудно,,, Не ОтборСудно.Пустая());
		
КонецПроцедуры

#КонецОбласти

#Область ДополнительныеДанныеДинамическихСписков

&НаСервереБезКонтекста
Функция ДополнительныеДанныеДляСписка(Настройки, Строки, ИмяПоляОтбора)
	
	СхемаКомпоновки = ПолучитьИзВременногоХранилища(Настройки.ДополнительныеСвойства.АдресСхемыКомпоновкиДанных);
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновки));
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновки.НастройкиПоУмолчанию);
	НастройкиКомпоновки = КомпоновщикНастроек.ПолучитьНастройки();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		НастройкиКомпоновки.Отбор, ИмяПоляОтбора, Строки.ПолучитьКлючи(), ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(
		СхемаКомпоновки, НастройкиКомпоновки,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений")); 
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ДополнительныеДанные = Новый ТаблицаЗначений;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ДополнительныеДанные);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	Возврат ДополнительныеДанные;

КонецФункции

#КонецОбласти

&НаКлиентеНаСервереБезКонтекста
Функция КлючУведомленияПослеПолученияДанных(ИмяСписка, УникальныйИдентификатор)
	// Сделаем ключ уведомления уникальным среди открытых форм пользвателя, 
	// чтобы текущая форма не воздействовала на другую, в которой используется этот же метод.
	Возврат СтрШаблон("%1ПослеПолученияДанных%2", ИмяСписка, УникальныйИдентификатор);
КонецФункции

&НаКлиенте
Процедура СписокФрахтовПослеПолученияДанных(Данные, ДополнительныеПараметры) Экспорт
	// Тут главное не делать ничего, что может спровоцировать обновление дин. списка.
	// Иначе получим бесконечный цикл.
	ТекущиеДанные = Элементы.СписокФрахтов.ТекущиеДанные;
	УстановитьДоступностьКомандФормы(ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область УправлениеЭлементамиФормы

&НаКлиенте
Процедура УстановитьОформлениеПоТипуРегистрации()
	
	Если гкс_ПриемкаТранспортаКлиентСервер.ЭтоПриемкаТранспорта(ОтборТипРегистрации) Тогда 
		Элементы.ГруппаДеталиПоФрахту	.Видимость = Истина;
		Элементы.СоздатьПрибытиеСудна	.Видимость = Истина;
		Элементы.РабочаяСменаНачать		.Видимость = Истина;
		Элементы.УправлениеРазгрузкой	.Видимость = Истина;
		Элементы.РабочаяСменаЗавершить	.Видимость = Истина;
	Иначе 
		Элементы.ГруппаДеталиПоФрахту	.Видимость = Ложь;
		Элементы.СоздатьПрибытиеСудна	.Видимость = Ложь;
		Элементы.РабочаяСменаНачать		.Видимость = Ложь;
		Элементы.УправлениеРазгрузкой	.Видимость = Ложь;
		Элементы.РабочаяСменаЗавершить	.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьКомандФормы(ТекущиеДанные)
	
	Если ТекущиеДанные = Неопределено Тогда
		Элементы.СоздатьПрибытиеСудна	.Доступность = Ложь;
		Элементы.РабочаяСменаНачать		.Доступность = Ложь;
		Элементы.УправлениеРазгрузкой	.Доступность = Ложь;
		Элементы.РабочаяСменаЗавершить	.Доступность = Ложь;
	Иначе
		
		ДоступностьКомандРабочейСмены	= ДоступностьКомандРабочейСмены(
			ТекущиеДанные.Фрахт, ТекущиеДанные.ПрибытиеСуднаНаПЛК);
		Элементы.СоздатьПрибытиеСудна	.Доступность = ТекущиеДанные.ПрибытиеСуднаНаПЛК.Пустая();
		Элементы.РабочаяСменаНачать		.Доступность = ДоступностьКомандРабочейСмены.РабочаяСменаНачать;
		Элементы.УправлениеРазгрузкой	.Доступность = ДоступностьКомандРабочейСмены.УправлениеРазгрузкой;
		Элементы.РабочаяСменаЗавершить	.Доступность = ДоступностьКомандРабочейСмены.РабочаяСменаЗавершить;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДоступностьКомандРабочейСмены(Фрахт, ПрибытиеСуднаНаПЛК)
	
	ПараметрыДоступности 	= Новый Структура;
	ОткрытыеСмены 			= гкс_МорскаяЛогистикаВызовСервера.СменыФрахта(Фрахт, Истина);
	ПараметрыДоступности.Вставить("РабочаяСменаНачать",
		Не ПрибытиеСуднаНаПЛК.Пустая() И ОткрытыеСмены.Количество() = 0);
	ПараметрыДоступности.Вставить("УправлениеРазгрузкой",
		Не ПрибытиеСуднаНаПЛК.Пустая() И ОткрытыеСмены.Количество() <> 0);
	ПараметрыДоступности.Вставить("РабочаяСменаЗавершить",
		Не ПрибытиеСуднаНаПЛК.Пустая() И ОткрытыеСмены.Количество() <> 0);
	
	Возврат ПараметрыДоступности;
	
КонецФункции
 
&НаКлиенте
Процедура НачатьСозданиеРабочейСмены(ДанныеФормыДляРабочейСмены)
	
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения(
		"ПродолжитьСозданиеРабочейСмены", ЭтотОбъект, ДанныеФормыДляРабочейСмены); 
	ТекстВопроса = СтрШаблон(
		НСтр("ru = 'Создать Рабочую смену для %1?'"), 
		Строка(ДанныеФормыДляРабочейСмены.Фрахт));
		
	ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстВопроса, 
		РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьСозданиеРабочейСмены(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗавершитьСозданиеРабочейСмены(ДополнительныеПараметры);
	ПоказатьПредупреждение(Неопределено, ДополнительныеПараметры.ОписаниеРезультата);
	Элементы.СписокФрахтов.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗавершитьСозданиеРабочейСмены(ДанныеФормыДляРабочейСмены)
	
	Попытка
		ДанныеЗаполнения = ПараметрыСозданияРабочейСмены(
			ДанныеФормыДляРабочейСмены.Фрахт, ДанныеФормыДляРабочейСмены.ТочкаМаршрута);
		РабочаяСмена = Документы.гкс_РабочаяСмена.СоздатьДокумент();
		РабочаяСмена.Заполнить(ДанныеЗаполнения);
		РабочаяСмена.Записать(РежимЗаписиДокумента.Проведение);
		ОписаниеРезультата = СтрШаблон(
			НСтр("ru = 'Успешно создан документ %1'"), Строка(РабочаяСмена.Ссылка)); 
		ДанныеФормыДляРабочейСмены.Вставить("ОписаниеРезультата", ОписаниеРезультата);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПредставлениеОшибкиДляПользователя = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		ПредставлениеОшибкиДляЖурнала = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Морская логистика.АРМ'"),
			УровеньЖурналаРегистрации.Ошибка,,, ПредставлениеОшибкиДляЖурнала);
		ДанныеФормыДляРабочейСмены.Вставить(
			"ОписаниеРезультата", ПредставлениеОшибкиДляПользователя);
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрыСозданияРабочейСмены(Фрахт, ТочкаМаршрута)
	
	МестнаяДата = Справочники.гкс_ТочкиМаршрута.ПолучитьМестнуюДатуПоТочкеМаршрута(ТочкаМаршрута);
	ПроизводственныеСутки = гкс_ПриемкаТранспорта.ПроизводственныеСуткиПоДата(МестнаяДата);
	
	ПараметрыСоздания = Новый Структура;
	ПараметрыСоздания.Вставить("ПроизводственныеСутки"	, ПроизводственныеСутки);
	ПараметрыСоздания.Вставить("ДатаНачала"				, МестнаяДата);
	ПараметрыСоздания.Вставить("Дата"					, МестнаяДата);
	ПараметрыСоздания.Вставить("Фрахт"					, Фрахт);
	
	Возврат ПараметрыСоздания;
	
КонецФункции

#КонецОбласти

&НаКлиенте
Процедура НачатьРедактированиеДатыОтборы(Шаг)
	
	ОтборДатаПрибытия = гкс_ОбщегоНазначенияКлиентСервер.СдвигДаты(ОтборДатаПрибытия, Шаг);
	УстановитьОтборыДинамическихСписков();

КонецПроцедуры

&НаКлиенте
Процедура НачатьСозданиеПрибытияСуднаНаПЛК(Фрахт)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Фрахт", Фрахт);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеСозданияПрибытияСуднаНаПЛК", ЭтотОбъект);
	
	ИмяОткрываемойФормы = "Документ.гкс_ПрибытиеСуднаНаПЛК.Форма.ПомощникЗаполнения";
	ОткрытьФорму(
		ИмяОткрываемойФормы, ПараметрыОткрытия, ЭтотОбъект,,,,
		ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеСозданияПрибытияСуднаНаПЛК(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.СписокФрахтов.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыходаИзУправленияРазгрузкой(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.СписокФрахтов.Обновить();
	Элементы.СостояниеОбработкиСудна.Обновить();
	Элементы.СостояниеОбработкиТрюма.Обновить();
	
КонецПроцедуры

#КонецОбласти
